{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "cancel_order",
    "1": "change_order",
    "2": "change_shipping_address",
    "3": "check_cancellation_fee",
    "4": "check_invoice",
    "5": "check_payment_methods",
    "6": "check_refund_policy",
    "7": "complaint",
    "8": "contact_customer_service",
    "9": "contact_human_agent",
    "10": "create_account",
    "11": "delete_account",
    "12": "delivery_options",
    "13": "delivery_period",
    "14": "edit_account",
    "15": "get_invoice",
    "16": "get_refund",
    "17": "newsletter_subscription",
    "18": "payment_issue",
    "19": "place_order",
    "20": "recover_password",
    "21": "registration_problems",
    "22": "review",
    "23": "set_up_shipping_address",
    "24": "switch_account",
    "25": "track_order",
    "26": "track_refund"
  },
  "initializer_range": 0.02,
  "label2id": {
    "cancel_order": 0,
    "change_order": 1,
    "change_shipping_address": 2,
    "check_cancellation_fee": 3,
    "check_invoice": 4,
    "check_payment_methods": 5,
    "check_refund_policy": 6,
    "complaint": 7,
    "contact_customer_service": 8,
    "contact_human_agent": 9,
    "create_account": 10,
    "delete_account": 11,
    "delivery_options": 12,
    "delivery_period": 13,
    "edit_account": 14,
    "get_invoice": 15,
    "get_refund": 16,
    "newsletter_subscription": 17,
    "payment_issue": 18,
    "place_order": 19,
    "recover_password": 20,
    "registration_problems": 21,
    "review": 22,
    "set_up_shipping_address": 23,
    "switch_account": 24,
    "track_order": 25,
    "track_refund": 26
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "use_cache": false,
  "vocab_size": 30522
}
